using System;

namespace Library
{
    class Program
    {
        static void Main(string[] args)
        {
            //LibraryProject();
            //библиотека
            //Описать класс Библиотека. 

            //Для описания могут понадобиться классы приведённые ниже

            //Автор(2 - 3 основных поля, свойства(сеттеры и геттеры для каждого поля),
            //несколько видов конструкторов, переопределить метод ToString().

            //Издательство(3 - 4 основных поля, свойства(сеттеры и геттеры для каждого поля),
            //несколько видов конструкторов, переопределить метод ToString()).

            //Книга(5 - 6 основных полей, свойства(сеттеры и геттеры для каждого поля),
            //несколько видов конструкторов, переопределить метод ToString()).

            //В классе книга в качестве типов полей для автора и издательства
            //использовать созданные классы.
        }
        static void LibraryProject()
        {
            //library
        }
    }
}
